TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
// Tx Ping timer and Rx Watchdog reference counter values
uint32_t txPingTimeRefCntr = 0x1000000, rxWdTimeoutRefCntr = 0x1400000;

// Boolean flag to enable/disable Rx Frame Watchdog
bool isRxFrameWdEnable = true;

//
// This value can be anything suitable to generate a single interrupt event,
// lower values may lead WD to trigger another event even before handler of 1st
// one is not completed
//
uint32_t rxFrameWdRefCntr = 0x1000000;

//
// Globals, these are not config parameters, user are not required to edit them
//
uint16_t txEventSts = 0, rxEventSts = 0;
uint16_t *txBufAddr = 0, *rxBufAddr = 0;

uint16_t txBufData[16] = {0};
uint16_t rxBufData[16] = {0};
volatile uint32_t fsiTxInt1Received = 0,fsiTxInt2Received = 0;
volatile uint32_t fsiRxInt1Received = 0,fsiRxInt2Received = 0;
uint32_t txTimeOutCntr = 0x100000, rxTimeOutCntr = 0x100000;
uint32_t dataFrameCntr = 0, dataFrameCntr_ui32 = 0;
uint32_t pingFrameCntr = 0, pingFrameCntr_ui32 = 0;

uint32_t dmaIntr1 = 0, dmaIntr2 = 0;
volatile uint16_t i = 0, *txTempData16 = 0, *rxTempData16 = 0;
uint32_t dmaTxIntCnt = 0, dmaRxIntCnt = 0;
uint32_t error = 0;
uint32_t rxclk_delay, rxd0_delay, rxd1_delay;


//
// Function Prototypes
//
static inline void compare16(uint16_t val1, uint16_t val2);
void compareBufData(uint16_t txBufIndex, uint16_t rxBufIndex, uint16_t nWords);
void disableAllFSIInterrupts(void);
void checkReceivedFrameTypeTag(FSI_FrameType type, FSI_FrameTag tag);
void initFSI(void);
void prepareTxBufData(void);
void testGPIO(void);
__interrupt void fsiTxInt1ISR(void);
__interrupt void fsiTxInt2ISR(void);
__interrupt void fsiRxInt1ISR(void);
__interrupt void fsiRxInt2ISR(void);
__interrupt void fsitxdma_isr(void);
__interrupt void fsirxdma_isr(void);
void fsitx_dma_config();
void fsirx_dma_config();
void InitFrameTagAndData();
void UpdateTxframeData();
void handshake_lead(void);

//
// Main
//
void main(void)
{
    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Disable pin locks and enable internal pullups.
    //
    Device_initGPIO();
    testGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // Initialize basic settings for FSI
    //
    initFSI();

    //
    // Interrupts that are used in this example are re-mapped to ISR functions
    // found within this file. Total 4; FSI Tx/Rx :: INT1/INT2
    //
    Interrupt_register(INT_FSITXA1, &fsiTxInt1ISR);
    Interrupt_register(INT_FSITXA2, &fsiTxInt2ISR);
    Interrupt_register(INT_FSIRXA1, &fsiRxInt1ISR);
    Interrupt_register(INT_FSIRXA2, &fsiRxInt2ISR);

    //
    // Enable FSI Tx/Rx interrupts
    //
    Interrupt_enable(INT_FSITXA1);
    Interrupt_enable(INT_FSITXA2);
    Interrupt_enable(INT_FSIRXA1);
    Interrupt_enable(INT_FSIRXA2);

#if FSI_DMA_ENABLE==1

    //
    // DMA Interrupts that are used in this example are re-mapped to ISR functions
    // found within this file.
    //
    Interrupt_register(INT_DMA_CH2, &fsitxdma_isr);
    Interrupt_register(INT_DMA_CH4, &fsirxdma_isr);

    //
    // Enable DMA interrupts
    //
    Interrupt_enable(INT_DMA_CH2);
    Interrupt_enable(INT_DMA_CH4);

#endif

    //
    // Enable Global Interrupt (INTM) and realtime interrupt (DBGM)
    //
    EINT;
    ERTM;

    //
    // Enable normal data receive events to be sent over INT1 line
    //
    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_PING_FRAME);

    //
    // Begin handshake -
    // Wait till interrupt is received on FSIRX INT1 line, verify it's for FRAME
    // DONE event for PING Frame reception
    //
    handshake_lead();

#if FSI_DELAY_LINE_CALIBRATION_ENABLE == 1

#if FSI_RX_TDM_ENABLE == 1
    // Disable FSI interrupts before starting calibration
     disableAllFSIInterrupts();

     // Variable for storing calculated FSI delay execution point
     volatile FSIExecutionPoint exePoint_leadrx;


     //
     // NextCalibrateTag used to signal next device to be calibrated -
     //
     //      "n" in FSI_FRAME_TAGn should be equal to CalibrateTag + 1
     //      If Lead device NextCalibrateTag "n" will be 0
     //
     FSI_FrameTag Node1_frame_tag = FSI_FRAME_TAG0;
     FSI_FrameTag Node2_frame_tag = FSI_FRAME_TAG1;


     DEVICE_DELAY_US(10); // Wait some time for devices to get ready

     // Signal first device in chain to be calibrated
     FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, Node1_frame_tag);

     //LEAD transmits pings for NODE1
     FSI_transmitToCalibrate(FSIRXA_BASE, FSITXA_BASE, PRESCALER_VAL);

     DEVICE_DELAY_US(100); // Wait some time for devices to get ready

       // Signal second device in chain to be calibrated
       FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, Node2_frame_tag);

       //LEAD transmits pings for NODE2
       FSI_transmitToCalibrate(FSIRXA_BASE, FSITXA_BASE, PRESCALER_VAL);

       DEVICE_DELAY_US(100); // Wait some time for devices to get ready

       //End of node Rx Delay line calibration
       FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, FSI_FRAME_TAG15);

       DEVICE_DELAY_US(10); // Wait some time for devices to get ready

       FSI_configPrescalar(FSITXA_BASE, PRESCALER_VAL);
       DEVICE_DELAY_US(0.1);
       FSI_enableTxClock(FSITXA_BASE);

         // Calibration starts for lead
         exePoint_leadrx = FSI_LpbkCalibrateExePoint(FSIRXA_BASE, FSITXA_BASE, nLanes);

         //execute flush sequence to reset all devices in the chain
         FSI_performRxInitialization(FSIRXA_BASE);
         FSI_executeTxFlushSequence(FSITXA_BASE, HANDSHAKE_PRESCALER_VAL);

         //END OF lead Rx delay line calibration
         FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, FSI_FRAME_TAG15);

         DEVICE_DELAY_US(1000); // Wait some time for devices to get ready


#else

         // Disable FSI interrupts before starting calibration
         disableAllFSIInterrupts();

         // Variable for storing calculated FSI delay execution point
         volatile FSIExecutionPoint exePoint;

         //
         // CalibrateTag used in delay line calibration sequence -
         //
         //      Calibration algorithm will look for this tag when in pass-through
         //      mode in order to know when it's the current device's turn to calibrate.
         //
         //      "n" in FSI_FRAME_TAGn should be equal to (Nth device in chain) - 1
         //      Example: for 1st node in chain (1 - 1) = 0 ==> FSI_FRAME_TAG0
         //      Lead device should have the highest Tag number.
         //
         FSI_FrameTag CalibrateTag = FSI_FRAME_TAG2;

         //
         // NextCalibrateTag used to signal next device to be calibrated -
         //
         //      "n" in FSI_FRAME_TAGn should be equal to CalibrateTag + 1
         //      If Lead device NextCalibrateTag "n" will be 0
         //
         FSI_FrameTag NextCalibrateTag = FSI_FRAME_TAG0;

         DEVICE_DELAY_US(1000); // Wait some time for devices to get ready

         //
         // Signal first device in chain to be calibrated
         //
         FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, NextCalibrateTag);

         //
         // Current device transmits to calibrate next device in chain
         //
         FSI_transmitToCalibrate(FSIRXA_BASE, FSITXA_BASE, PRESCALER_VAL);

         //
         // Go into pass-through mode, forwarding frames received until
         //  CalibrateTag data frame is received
         //
         FSI_daisy_calibratePassThrough(FSIRXA_BASE, FSITXA_BASE,
                                    HANDSHAKE_PRESCALER_VAL, CalibrateTag);

         //
         // Wait to receive ping frames signaling start of calibration process
         //
         while(!(FSI_getRxEventStatus(FSIRXA_BASE) & FSI_RX_EVT_PING_FRAME));

         //
         // Calibrate current device in chain
         //
         exePoint = FSI_calibrateExecutionPoint(FSIRXA_BASE, FSITXA_BASE,
                                            nLanes, HANDSHAKE_PRESCALER_VAL);

