TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
         DEVICE_DELAY_US(10); // Wait some time for devices to get ready

         //
         // Send data frame with Tag15 to signal end of calibration
         //
         FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, FSI_FRAME_TAG15);

         DEVICE_DELAY_US(1000); // Wait some time for devices to get ready

#endif

#endif

//    ESTOP0; //Added for debug
    FSI_configPrescalar(FSITXA_BASE, PRESCALER_VAL);
    DEVICE_DELAY_US(0.1);
    FSI_enableTxClock(FSITXA_BASE);

    // Set FSI TX buffer pointer to beginning
    FSI_setTxBufferPtr(FSITXA_BASE, 0U);

    // Set FSI RX buffer pointer to beginning
    FSI_setRxBufferPtr(FSIRXA_BASE, 0U);


    // Setting for requested nWords and nLanes with transfers
    FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_NWORD_DATA);
    FSI_setTxSoftwareFrameSize(FSITXA_BASE, nWords);
    FSI_setTxDataWidth(FSITXA_BASE, nLanes);
    // RX setting part
    FSI_setRxSoftwareFrameSize(FSIRXA_BASE, nWords);
    FSI_setRxDataWidth(FSIRXA_BASE, nLanes);


    //
    // Enable transmit/receive error events to be sent over INT2 line
    // Overrun and Underrun conditions in Rx are not enabled as buffer pointers
    // are always overwritten to first location for sending data frames.
    //
    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT2, FSI_RX_EVT_CRC_ERR  |
                                                 FSI_RX_EVT_EOF_ERR  |
                                                 FSI_RX_EVT_TYPE_ERR);

    FSI_disableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_PING_FRAME);
    DEVICE_DELAY_US(10);
    FSI_enableTxInterrupt(FSITXA_BASE, FSI_INT1, FSI_TX_EVT_FRAME_DONE);

    DEVICE_DELAY_US(1000); // Delay needed for Node setup time

    #if FSI_DMA_ENABLE==0

    FSI_setTxUserDefinedData(FSITXA_BASE, txUserData);
    FSI_setTxFrameTag(FSITXA_BASE, txDataFrameTag);

    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_DATA_FRAME);

    #else

    //
    // Initialize the dma channels for both tx and rx buffers
    //
    DMA_initController();

    fsirx_dma_config();
    fsitx_dma_config();

    FSI_setTxStartMode(FSITXA_BASE, FSI_TX_START_FRAME_CTRL_OR_UDATA_TAG);

    #if TX_DMA_TRIGGER_ENABLE == 1
    // Enable DMA event on FSI Tx
    FSI_enableTxDMAEvent(FSITXA_BASE);
    #endif

    // Enable DMA event on FSI Rx
    FSI_enableRxDMAEvent(FSIRXA_BASE);

    InitFrameTagAndData();

    // Start TX /RX channels

    DMA_startChannel(DMA_CH1_BASE);
    DMA_startChannel(DMA_CH2_BASE);

    DMA_startChannel(DMA_CH3_BASE);
    DMA_startChannel(DMA_CH4_BASE);

    // use software to trigger the first transfer
    DMA_forceTrigger(DMA_CH1_BASE);
    DMA_forceTrigger(DMA_CH2_BASE);
    #endif

    while(1)
    {

    #if FSI_DMA_ENABLE==0

        // Now, start transmitting data frames

        // Fill TX array with new data
        prepareTxBufData();

        // Write data into Tx buffer
        // Start the first transfer
        FSI_writeTxBuffer(FSITXA_BASE, txBufData, nWords, 0U);
        FSI_startTxTransmit(FSITXA_BASE);
        //DEBUG MARKER: Lead Tx transmit trigger
         GPIO_writePin(DATA_FRAME_TEST_IO,0);

        //
        // Wait for TX frame done event
        //
        while(fsiTxInt1Received != 1U);

        //
        // Wait for RX data frame received event
        //
        while(fsiRxInt1Received != 1U);

        if(error == 0)
        {
            fsiTxInt1Received = 0U;
            fsiRxInt1Received = 0U;
        }

        else
        {
            // Error occurred during communications
            ESTOP0;
        }

    #else
        //
        // Wait for both TX and RX channels to complete a transfer
        //
        while(dmaIntr1 == 0U); // TX Int flag
        dmaIntr1 = 0;

        while(dmaIntr2 == 0U); // RX Int flag
        dmaIntr2 = 0;

        if(error != 0)
        {
            DMA_disableInterrupt(DMA_CH2_BASE);
            DMA_disableInterrupt(DMA_CH4_BASE);

            // Error occurred during communications
            ESTOP0;
        }

    #endif
    }
}


void handshake_lead(void)
{
    while(1)
    {
        //
        // Send the flush sequence
        //
        FSI_executeTxFlushSequence(FSITXA_BASE, PRESCALER_VAL);

        //
        // Send a ping frame with frame tag 0000b
        //
        FSI_setTxFrameTag(FSITXA_BASE, FSI_FRAME_TAG0);
        FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_PING);
        FSI_startTxTransmit(FSITXA_BASE);

        while(fsiRxInt1Received != 1U && rxTimeOutCntr != 0U)
        {
            DEVICE_DELAY_US(1);
            rxTimeOutCntr--;
        }

        if(rxTimeOutCntr == 0)
        {
            rxTimeOutCntr = 0x100000;
            continue;
        }
        else
        {
            compare16(rxEventSts, (FSI_RX_EVT_PING_FRAME | FSI_RX_EVT_FRAME_DONE));
            checkReceivedFrameTypeTag(FSI_FRAME_TYPE_PING, FSI_FRAME_TAG0);

            //
            // If received frame type and tag matches, exit this loop and proceed
            // to next step by sending flush sequence, otherwise clear error and
            // interrupt flag and continue looping.
            //
            if(error == 0)
            {
                fsiRxInt1Received = 0;
                break;
            }

            fsiRxInt1Received = 0;
            error = 0;
        }
    }

    while(1)
    {
        //
        // Send a ping frame with frame tag 0001b
        //
        FSI_setTxFrameTag(FSITXA_BASE, FSI_FRAME_TAG1);
        FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_PING);
        FSI_startTxTransmit(FSITXA_BASE);

        while(fsiRxInt1Received != 1U && rxTimeOutCntr != 0U)
             {
                 DEVICE_DELAY_US(1);
                 rxTimeOutCntr--;
             }

             if(rxTimeOutCntr == 0)
             {
                 rxTimeOutCntr = 0x100000;
                 continue;
             }
             else
             {
                 compare16(rxEventSts, (FSI_RX_EVT_PING_FRAME | FSI_RX_EVT_FRAME_DONE));
                 checkReceivedFrameTypeTag(FSI_FRAME_TYPE_PING, FSI_FRAME_TAG1);

                 //
                 // If received frame type and tag matches, exit this loop and proceed
                 // to next step by sending flush sequence, otherwise clear error and
                 // interrupt flag and continue looping.
                 //
                 if(error == 0)
                 {
                     fsiRxInt1Received = 0;
                     break;
                 }

                 fsiRxInt1Received = 0;
                 error = 0;
             }
    }
}

//
// initFSI - Initializes FSI Tx/Rx and also sends FLUSH sequence.
//
void initFSI(void)
{
    FSI_disableRxInternalLoopback(FSIRXA_BASE);

    //
    // NOTE: External loopback, Modify GPIO settings as per setup
    //
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_TXCLK);
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_TX0);

    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_RXCLK);
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_RX0);

