TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
    #if TX_DMA_TRIGGER_ENABLE == 1
    DMA_configMode(DMA_CH1_BASE, DMA_TRIGGER_FSITXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #else
    DMA_configMode(DMA_CH1_BASE, DMA_TRIGGER_SOFTWARE, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #endif

    DMA_disableInterrupt(DMA_CH1_BASE);
    DMA_enableTrigger(DMA_CH1_BASE);

    //
    // For the tag and userdata fields
    //
    DMA_configAddresses(DMA_CH2_BASE, (uint16_t *)FSI_TX_FRAME_TAG_UDATA_REGADDR,
                        (uint16_t *)GS1_START_ADDR);
    DMA_configBurst(DMA_CH2_BASE, 1, 0, 0);
    DMA_configTransfer(DMA_CH2_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH2_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);

    #if TX_DMA_TRIGGER_ENABLE == 1
    DMA_configMode(DMA_CH2_BASE, DMA_TRIGGER_FSITXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #else
    DMA_configMode(DMA_CH2_BASE, DMA_TRIGGER_SOFTWARE, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #endif

    DMA_setInterruptMode(DMA_CH2_BASE, DMA_INT_AT_END);
    DMA_enableInterrupt(DMA_CH2_BASE);

    DMA_enableTrigger(DMA_CH2_BASE);
}

//
// fsirx_dma_config - Sets up DMA channels(Ch3 and Ch4) for FSI Rx operation
//
void fsirx_dma_config()
{
    //
    // GS2 RAM to save received Rx frame data
    //
    DMA_configAddresses(DMA_CH3_BASE, (uint16_t *)GS2_START_ADDR, rxBufAddr);
    DMA_configBurst(DMA_CH3_BASE, nWords, 1, 1);
    DMA_configTransfer(DMA_CH3_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH3_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);
    DMA_configMode(DMA_CH3_BASE, DMA_TRIGGER_FSIRXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE |DMA_CFG_SIZE_16BIT);

    DMA_disableInterrupt(DMA_CH3_BASE);
    DMA_enableTrigger(DMA_CH3_BASE);

    //
    // For the tag and userdata fields
    //
    DMA_configAddresses(DMA_CH4_BASE,(uint16_t *)GS3_START_ADDR,
                        (uint16_t *)FSI_RX_FRAME_TAG_UDATA_REGADDR);
    DMA_configBurst(DMA_CH4_BASE, 1, 0, 0);
    DMA_configTransfer(DMA_CH4_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH4_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);
    DMA_configMode(DMA_CH4_BASE, DMA_TRIGGER_FSIRXA, DMA_CFG_ONESHOT_DISABLE |
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);

    DMA_setInterruptMode(DMA_CH4_BASE, DMA_INT_AT_END);
    DMA_enableInterrupt(DMA_CH4_BASE);
    DMA_enableTrigger(DMA_CH4_BASE);
}

//
// InitFrameTagAndData - Initializes GS0/GS1 memories to populate tag and data
//                       for frame transfers
//
void InitFrameTagAndData(void)
{
    unsigned int i;
    uint16_t *temp;

    temp = (uint16_t *)GS0_START_ADDR;
    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        *temp = i;
        temp++;
    }

    temp = (uint16_t *)GS1_START_ADDR;
    for(i = FSI_FRAME_TAG0; i < FSI_FRAME_TAG15; i++)
    {
        //
        //tag and user data
        //
        *temp = ((0x0 + i) | ((unsigned long)(0x0 + i) << 8));
        temp++;
    }
}

//
// UpdateTxframeData - Updates GS0 memory with new data for frame transfer
//
void UpdateTxframeData(void)
{
    unsigned int i;
    uint16_t *temp;

    temp = (uint16_t *)GS0_START_ADDR;
    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        *temp = *temp + 1;
        temp++;
    }

}

//
// fsitxdma_isr - FSI TX DMA ISR
//
interrupt void fsitxdma_isr(void)
{
    GPIO_writePin(DATA_FRAME_TEST_IO,0);

    dmaTxIntCnt++; // Increment DMA TX interrupt counter

    dmaIntr1 = 1;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}


//
// fsirxdma_isr - FSI RX DMA ISR
//
interrupt void fsirxdma_isr(void)
{
    GPIO_writePin(DATA_FRAME_TEST_IO,1);

    // Set FSI RX circular buffer pointer back to beginning
    FSI_setRxBufferPtr(FSIRXA_BASE, 0U);

    dmaRxIntCnt++; // Increment DMA RX interrupt counter

    #if TX_DMA_TRIGGER_ENABLE == 0

    //
    // Verify TX data is same as RX data
    //
    txTempData16 = (uint16_t *)(GS0_START_ADDR);
    rxTempData16 = (uint16_t *)(GS2_START_ADDR);

    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        compare16(*txTempData16,*rxTempData16);
        txTempData16++;
        rxTempData16++;
    }

    dataFrameCntr++;

    if(dataFrameCntr >= 0xFFFFFFFF)
    {
        dataFrameCntr_ui32++;
        dataFrameCntr = 0;
    }

    UpdateTxframeData(); // Update TX Frame data (GS0 memory)

    // Trigger TX DMA channels 1 & 2
    DMA_forceTrigger(DMA_CH1_BASE);
    DMA_forceTrigger(DMA_CH2_BASE);

    #endif

    dmaIntr2 = 1;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}


//
// End of File
//
